app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        if @post.save
---
INSERT INTO "posts" ("authour", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["authour", ""], ["title", ""], ["content", ""], ["created_at", "2021-01-13 13:07:55.902519"], ["updated_at", "2021-01-13 13:07:55.902519"]]